In [1]:
import sqlite3
import pandas as pd

In [2]:
# Connect to the database
conn = sqlite3.connect('user_accounts.db')

In [3]:
# Get all table names in the database
cursor = conn.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

# Print the table names
print("Tables in the database:", tables)

Tables in the database: [('users',)]

In [5]:
# Query data from the chosen table
df = pd.read_sql_query("SELECT * FROM users;", conn)

# Display the first few rows of the table
df.head()  # This shows the first 5 rows

   id username password
0   1      naz      123
1   2      ros      123